[
  {
    "bookId": 1,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/zS64fTR/1.jpg",
    "review": "The Catcher in the Rye is a timeless coming-of-age novel that continues to resonate with readers decades after its initial publication. Narrated by the iconic and cynical protagonist, Holden Caulfield, the novel takes readers on a journey through his experiences in New York City after being expelled from prep school. Through Holden's distinctive voice, readers are immersed in his struggles with identity, innocence, and alienation. Salinger's portrayal of adolescence is raw and honest, capturing the complexities and contradictions of youth with remarkable authenticity. The novel's exploration of themes such as phoniness, authenticity, and the loss of innocence resonates with readers of all ages, making it a classic of American literature.",
    "totalPages": 224,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["coming-of-age", "classic", "adolescence"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/wMgRBzJ/2.jpg",
    "review": "To Kill a Mockingbird is a poignant exploration of racial injustice and moral growth in the American South. Set in the fictional town of Maycomb, Alabama, during the Great Depression, the novel follows the experiences of Scout Finch, a young girl growing up in a racially divided society. Through Scout's eyes, readers witness her father, Atticus Finch, a lawyer, defending Tom Robinson, a black man falsely accused of raping a white woman. Harper Lee masterfully weaves together themes of empathy, compassion, and social justice, offering a powerful critique of prejudice and discrimination. With its enduring relevance and universal themes, To Kill a Mockingbird remains a seminal work of American literature.",
    "totalPages": 281,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["classic", "race", "law"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/R91xDJX/3.jpg",
    "review": "The Great Gatsby is an evocative portrayal of the Jazz Age, delving into themes of love, wealth, and the American Dream. Set in the summer of 1922, the novel follows the enigmatic millionaire Jay Gatsby and his obsession with the beautiful Daisy Buchanan. Through the eyes of Nick Carraway, the narrator, readers are drawn into a world of extravagance, excess, and disillusionment. F. Scott Fitzgerald's lyrical prose and keen observations capture the allure and emptiness of the Roaring Twenties, exposing the moral decay lurking beneath the surface of wealth and privilege. With its timeless themes and memorable characters, The Great Gatsby continues to captivate readers and inspire countless adaptations.",
    "totalPages": 180,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["classic", "romance", "wealth"],
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 4,
    "bookName": "Sapiens: A Brief History of Humankind",
    "author": "Yuval Noah Harari",
    "image": "https://i.ibb.co/Brw83mn/4.png",
    "review": "Sapiens: A Brief History of Humankind is a captivating journey through the history of Homo sapiens, offering profound insights into human evolution. Yuval Noah Harari masterfully navigates through the key revolutions in human history, from the Cognitive Revolution, which gave rise to modern human behavior, to the Agricultural Revolution, which transformed societies into settled communities. Drawing on a wide range of disciplines, including biology, anthropology, and economics, Harari challenges conventional wisdom and prompts readers to rethink their understanding of the human story. With its accessible writing style and thought-provoking ideas, Sapiens has become a global phenomenon, sparking conversations about the past, present, and future of humanity.",
    "totalPages": 443,
    "rating": 4.8,
    "category": "Non-fiction",
    "tags": ["history", "anthropology", "science"],
    "publisher": "Harper",
    "yearOfPublishing": 2011
  },
  {
    "bookId": 5,
    "bookName": "The Subtle Art of Not Giving a F*ck",
    "author": "Mark Manson",
    "image": "https://i.ibb.co/XWtv8vN/5.jpg",
    "review": "The Subtle Art of Not Giving a F*ck is a refreshing take on self-help, advocating for a realistic and pragmatic approach to life. Mark Manson challenges the traditional self-help narrative of relentless positivity and endless ambition, arguing instead for the importance of embracing limitations and choosing what truly matters. With a blend of humor, wit, and brutal honesty, Manson offers practical advice for living a more fulfilling life, grounded in values and purpose. By encouraging readers to confront uncomfortable truths and accept responsibility for their choices, The Subtle Art of Not Giving a F*ck empowers individuals to let go of societal expectations and prioritize their own well-being.",
    "totalPages": 212,
    "rating": 4.2,
    "category": "Non-fiction",
    "tags": ["self-help", "motivation", "psychology"],
    "publisher": "HarperOne",
    "yearOfPublishing": 2016
  },
  {
    "bookId": 6,
    "bookName": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "image": "https://i.ibb.co/DD7kYZZ/6.webp",
    "review": "The Hitchhiker's Guide to the Galaxy is a hilarious and inventive romp through the cosmos, blending science fiction with wit and absurdity. Douglas Adams introduces readers to the bewildered Arthur Dent, who finds himself embarking on an intergalactic adventure after Earth is unexpectedly demolished to make way for a hyperspace bypass. Joined by his alien friend Ford Prefect, the two embark on a journey filled with bizarre encounters, improbable situations, and philosophical ponderings. With its dry British humor and satirical commentary on life, the universe, and everything in between, The Hitchhiker's Guide to the Galaxy is a beloved classic that continues to delight readers of all ages.",
    "totalPages": 193,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["humor", "space", "adventure"],
    "publisher": "Pan Books",
    "yearOfPublishing": 1979
  }
]
